HelpDesk/src/InformationRegisters/ПапкиУчетныхЗаписей/ПапкиУчетныхЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПапкиУчетныхЗаписей</name>
  <resources>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПапки</name>
    <type>
      <types>EnumRef.ВидыПапокПисем</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HelpDesk/src/InformationRegisters/ПапкиУчетныхЗаписей/ManagerModule.bsl
// Добавляет запись.
//
Процедура УстановитьПапку(УчетнаяЗапись, ВидПапки, Папка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрана учетная запись'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидПапки) Тогда
		ВызватьИсключение НСтр("ru = 'Не выбран вид папки'");
	КонецЕсли;
	
	Запись = РегистрыСведений.ПапкиУчетныхЗаписей.СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.ВидПапки = ВидПапки;
	Запись.Прочитать();
	
	Если Запись.Выбран() И Не ЗначениеЗаполнено(Папка) Тогда
		Запись.Удалить();
		Возврат;
	КонецЕсли;
	
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.ВидПапки = ВидПапки;
	Запись.Папка = Папка;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Возвращает папку необходимого вида для учетной записи.
//
Функция ПолучитьПапку(УчетнаяЗапись, ВидПапки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрана учетная запись'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидПапки) Тогда
		ВызватьИсключение НСтр("ru = 'Не выбран вид папки'");
	КонецЕсли;
	
	Запись = РегистрыСведений.ПапкиУчетныхЗаписей.СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.ВидПапки = ВидПапки;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Запись.Папка;
	
КонецФункции
